#include <stdio.h>
int main () {
int lavel; // ตัวเเปลเก็บค่าระดับ
printf("กรุณาป้อนค่าระดับ (1-4): "); // รับค่าตัวเเปล lavel
scanf("%d", &lavel); //อ้านค่าตัวเเปล lavel
switch (lavel)  // ตรวจสอบค่าระดับ
{
case 1: 
    printf("silver\n"); //กรณ๊ระดับเป็นที่ 1
    break;
case 2:
    printf("Gold\n"); //กรณ๊ระดับเป็นที่ 2
    break; 
case 3:
    printf("platinum\n"); //กรณ๊ระดับเป็นที่ 3
    break;
case 4:
    printf("diamond\n"); //กรณ๊ระดับเป็นที่ 4
    break;
default:
    printf("Invalid membership level\n"); //กรณ๊ระดับไม่ถูกต้อง
    break;
}

 // ใช้ switch-case ตรวจสอบค่าระดับ
switch (lavel) {
case 1:
    printf(" discount 5%%\n"); //กรณ๊ระดับเป็นที่ 1 
    break;
case 2:
    printf("discount 10%% + Reward points\n"); //กรณ๊ระดับเป็นที่ 2
    break;
case 3:
    printf(" discount 15%% + Reward points + birthday gift\n"); //กรณ๊ระดับเป็นที่ 3
    break;
case 4:
    printf("ได้ครบทุกอย่าง + VIP events\n"); //กรณ๊ระดับเป็นที่ 4
    break;

}
return 0;
}

//ความแตกต่างระหว่าง if-else if-else และ switch-case
//if-else if-else เป็นโครงสร้างการตัดสินใจที่ยืดหยุ่นมากที่สุด เหมาะสำหรับการเปรียบเทียบเงื่อนไขที่ซับซ้อน หรือการเปรียบเทียบกับค่าที่ไม่ใช่ตัวเลข
//ความยืดหยุ่น: สามารถใช้กับเงื่อนไขที่หลากหลาย เช่น > (มากกว่า), < (น้อยกว่า), && (และ), || (หรือ)
//การเปรียบเทียบ: ใช้ได้กับการเปรียบเทียบค่าที่ไม่เท่ากัน เช่น if (score >= 80) หรือ if (age < 18 && has_permission == true)
//การใช้งาน:เหมาะสำหรับเงื่อนไขที่ต้องตรวจสอบช่วงของค่า (range) หรือการเปรียบเทียบที่ซับซ้อน

//switch-case เป็นโครงสร้างที่ออกแบบมาเพื่อจัดการกับกรณีที่มีการเปรียบเทียบค่าคงที่หลาย ๆ ค่าจากตัวแปรตัวเดียว
//ความแม่นยำ: ทำงานได้เร็วและมีประสิทธิภาพสูงกว่า if-else if-else ในกรณีที่ต้องเปรียบเทียบกับค่าคงที่จำนวนมาก
//การเปรียบเทียบ: ใช้ได้เฉพาะการเปรียบเทียบความเท่ากัน (==) กับค่าคงที่ที่เป็นจำนวนเต็มหรือตัวอักษรเท่านั้น
//การใช้งาน: เหมาะสำหรับเมนูหรือตัวเลือกที่มีจำนวนจำกัด เช่น การเลือกวันในสัปดาห์ (1-7) หรือการเลือกระดับสมาชิก (1-4)
//คำสั่ง break: จำเป็นต้องใช้คำสั่ง break เพื่อป้องกันไม่ให้โปรแกรมทำงาน ไปยัง case ถัดไป